#ifndef _HARDWARE_H
#define _HARDWARE_H

#include "common.h"

//***********************************************
// System Define
//***********************************************
#define	FIRMWARE_VER	0x10

// V5.5  : 2018.08.16, motion status filtering
//                     FPGA Read/Write 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽﾃ･
#define		FIRM_VER	0x55
#define		FPGA_VER	FpgaVersion()

//***********************************************
// System Function
//***********************************************

// 魹ｽﾏｵ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾊｱ魹ｽﾈｭ 魹ｽﾔｼ魹ｽ
// CPU, FPGA 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾍｸ魹ｽ 魹ｽﾊｱ魹ｽﾈｭ魹ｽ魹ｽ
void InitHardware();

// 魹ｽﾃｸ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽﾆｮ 2魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ
#define UART_PORT0       0
#define UART_PORT1       1

// UART 魹ｽﾊｱ魹ｽﾈｭ 魹ｽﾔｼ魹ｽ
// - port	  : uart port number
// - baudrate : 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ baudrate 魹ｽ魹ｽ (9600 ‾ 115200)
void UartInit(int port, unsigned long baudrate);

// UART 魹ｽ魹ｽ魹ｽﾅｹ魹ｽ魹ｽﾛｿ魹ｽ魹ｽ魹ｽ 1 byte魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾔｼ魹ｽ
// - port	: uart port number
// - *ptr : char pointer
// - return : 0(魹ｽ魹ｽ魹ｽﾅｵ魹ｽ魹ｽ魹ｽ魹ｽﾍｾ魹ｽ魹ｽ魹ｽ), 1(魹ｽ魹ｽ魹ｽﾅｵ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ)
int PopRcvChar(int port, char *ptr);

// UART 魹ｽﾛｽ魹ｽ 魹ｽﾔｼ魹ｽ
// - port	: uart port number
// - *bytes : 魹ｽﾛｽ魹ｽ 魹ｽ魹ｽ魹ｽﾚｿ魹ｽ魹ｽ魹ｽ pointer
// - length : 魹ｽﾛｽ魹ｽ 魹ｽ魹ｽ魹ｽﾚｿ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ
void SerialWriteBytes(int port, const void *bytes, unsigned long length);
void SerialWriteString(int port, const void *bytes);

// us 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾔｼ魹ｽ
void DelayUS(unsigned long us);

// ms 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾔｼ魹ｽ
void DelayMS(unsigned long ms);

// 2013.3.20
// us 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ tic counter 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾐｾ魹ｽﾂｴ魹ｽ.
unsigned long GetTicCountUS();

// 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾖｴ魹ｽ State LED魹ｽ魹ｽ ON 魹ｽ魹ｽﾅｲ魹ｽ魹ｽ.
void StatusLedOn();

// 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾖｴ魹ｽ State LED魹ｽ魹ｽ OFF 魹ｽ魹ｽﾅｲ魹ｽ魹ｽ.
void StatusLedOff();

// 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾖｴ魹ｽ State LED魹ｽ魹ｽ TOGGLE 魹ｽ魹ｽﾅｲ魹ｽ魹ｽ.
void StatusLedToggle();

// 魹ｽﾝｹ魹ｽ 魹ｽﾔｼ魹ｽ : 1ms 魹ｽ魹ｽ魹ｽﾍｷ魹ｽﾆｮ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽﾆｾ
// 魹ｽ魹ｽ魹ｽﾌｺ彀ｯ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ ISR 魹ｽ魹ｽ魹ｽ魹ｽ 25us 魹ｽﾒｿ魹ｽ魹ｽ
void TimerIsr_1ms();

// FPGA 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾐｾ魹ｽﾂｴ魹ｽ.
unsigned char FpgaVersion();

//***********************************************
// Motion Define & Structure
//***********************************************
//#define	MAX_AXIS		3		// 魹ｽﾖｴ魹ｽ 魹ｽ魹ｽ魹ｽ

#define	CCW				1		// 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾝｽﾃｰ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ
#define	CW				0		// 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾃｰ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ

#define	MOVE_TORQUE		60		// 魹ｽ魹ｽ魹ｽﾛｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ (魹ｽ魹ｽ魹ｽ魹ｽ : 0.03A, 魹ｽ魹ｽ魹ｽ魹ｽ : 0 ‾ 100) ex) 40 => 1.2A
#define	HOLD_TORQUE		20		// 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ (魹ｽ魹ｽ魹ｽ魹ｽ : 0.03A, 魹ｽ魹ｽ魹ｽ魹ｽ : 0 ‾ 100) ex) 10 => 0.3A

#define	MOVE_TORQUE_3A	80		// 魹ｽ魹ｽ魹ｽﾛｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ (魹ｽ魹ｽ魹ｽ魹ｽ : 0.03A, 魹ｽ魹ｽ魹ｽ魹ｽ : 0 ‾ 100) ex) 80 => 2.4A
#define	HOLD_TORQUE_3A	20		// 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ (魹ｽ魹ｽ魹ｽ魹ｽ : 0.03A, 魹ｽ魹ｽ魹ｽ魹ｽ : 0 ‾ 100) ex) 20 => 0.6A


// 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ ﾈｮ魹ｽ魹ｽ 魹ｽ魹ｽ 魹ｽ魹ｽ 魹ｽﾖｴ魹ｽ 魹ｽ魹ｽ魹ｽﾂｵ魹ｽ
// GetMoveStatus() 魹ｽﾔｼ魹ｽ魹ｽ魹ｽ 魹ｽﾌｿ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽﾂｸ魹ｽ 魹ｽ魹ｽ魹ｽﾃｼ魹ｽ 魹ｽﾖｴ魹ｽ
#define	MOVE_STS_STOP			0x00	// 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ
#define	MOVE_STS_VMIN			0x01	// 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ
#define	MOVE_STS_ACEL			0x02	// 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ
#define	MOVE_STS_VMAX			0x03	// 魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ (魹ｽﾖｴ魹ｽ魹ｽ)
#define	MOVE_STS_DCEL			0x04	// 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ
#define	MOVE_STS_INPOS			0x05	// INPOSITION 魹ｽ魹ｽ魹ｽ魹ｽ

// 魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾊｿ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽﾆｳ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽﾃｼ
// App 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾏｰ魹ｽ Lib 魹ｽ魹ｽ魹ｽﾎｿ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽﾑｴ魹ｽ.
// MoveStart() 魹ｽﾔｼ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾏｿ魹ｽ 魹ｽ魹ｽﾇｱ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾏｰ魹ｽ 魹ｽﾈｴ魹ｽ.
typedef struct _MOVE_VARIABLE
{
	unsigned int  m_uS;			// 魹ｽﾌｵ魹ｽ 魹ｽﾅｸ魹ｽ (魹ｽ魹ｽ魹ｽ魹ｽ : pulse, 魹ｽ魹ｽ魹ｽ魹ｽ : 0 ‾ 2147483647)
	unsigned char m_ucDir;		// 魹ｽﾌｵ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ (0 : CW, 1 : CCW)
	unsigned int  m_uVmax;		// 魹ｽﾖｴ魹ｽ 魹ｽﾓｵ魹ｽ (魹ｽ魹ｽ魹ｽ魹ｽ : pps, 魹ｽ魹ｽ魹ｽ魹ｽ : 0 ‾ 524287)
	unsigned int  m_uVmin;		// 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾓｵ魹ｽ (魹ｽ魹ｽ魹ｽ魹ｽ : pps, 魹ｽ魹ｽ魹ｽ魹ｽ : 0 ‾ 32767)
	unsigned int  m_uAcel;		// 魹ｽ魹ｽ/魹ｽ魹ｽ 魹ｽﾓｵ魹ｽ (魹ｽ魹ｽ魹ｽ魹ｽ : pps2, 魹ｽ魹ｽ魹ｽ魹ｽ : 0 ‾ 1023)
	unsigned char m_ucMoveTorq;	// 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ (魹ｽ魹ｽ魹ｽ魹ｽ : 0.03A, 魹ｽ魹ｽ魹ｽ魹ｽ : 0 ‾ 100)
	unsigned char m_ucHoldTorq;	// 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ (魹ｽ魹ｽ魹ｽ魹ｽ : 0.03A, 魹ｽ魹ｽ魹ｽ魹ｽ : 0 ‾ 100)
} MOVE_VARIABLE;

// 魹ｽ魹ｽﾆｮ魹ｽ魹ｽﾅｩ 魹ｽﾄｶ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽﾃｼ
// EEPROM 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾖｼ魹ｽ : 0x01C0
typedef unsigned char 	BYTE;
typedef struct
{
	BYTE bCheck1;		// 0x0000	// 魹ｽﾗｽ魹ｽ 0xa5 魹ｽﾌｾ魹ｽ魹ｽ 魹ｽﾇｹﾌｰ魹ｽ 魹ｽﾖｴ魹ｽ.
	BYTE bCheck2;		// 0x0001	// 魹ｽﾗｽ魹ｽ 0x5a 魹ｽﾌｾ魹ｽ魹ｽ 魹ｽﾇｹﾌｰ魹ｽ 魹ｽﾖｴ魹ｽ.
    BYTE IPAddr[4];		// 0x0002
    BYTE MACAddr[6];	// 0x0006
    BYTE Mask[4];		// 0x000C
    BYTE GateWay[4];	// 0x0010
	int	 nTcpSvrPort;	// 0x0014

    BYTE bIsDHCPEnabled;// 0x0018

	BYTE NetBIOSName[6];// 0x0019
	BYTE szNull;		// 0x001F
} APPL_CONFIG;

// 魹ｽﾃｽ魹ｽ魹ｽ魹ｽ 魹ｽﾚｵ魹ｽ, 魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽﾃｼ
// EEPROM 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾖｼ魹ｽ : 0x01E0
typedef struct
{
	BYTE szCode[16];// 0
	BYTE nAxis;		// 16
	BYTE nInput;	// 17
	BYTE nOutput;	// 18
	BYTE szNull;	// 19
	int  nTimeout;	// 20	
} SYS_INFO;

extern APPL_CONFIG ApplConfig;
extern SYS_INFO SysInfo;

//***********************************************
// Motion Function
//***********************************************

// 魹ｽ魹ｽ魹ｽﾜｸ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽﾌｹ魹ｽ Enable 魹ｽﾔｼ魹ｽ
// - axis : 0(Z) : 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾈ｣
void DriverEnable(char axis);

// 魹ｽ魹ｽ魹ｽﾜｸ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽﾌｹ魹ｽ Disable 魹ｽﾔｼ魹ｽ
// - axis : 0(Z) : 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾈ｣
void DriverDisable(char axis);

// 魹ｽ魹ｽ魹ｽﾜｸ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽﾌｹ魹ｽ魹ｽ魹ｽ 魹ｽﾌｻ魹ｽ魹ｽ魹ｽﾂｸ魹ｽ ﾈｮ魹ｽ魹ｽ魹ｽﾏｱ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾔｼ魹ｽ
// 魹ｽ魹ｽ魹ｽﾜｸ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽﾌｹ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾌｻ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽﾇｸ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽﾌｹ魹ｽ魹ｽ魹ｽ Shutdown 魹ｽ魹ｽ 魹ｽ魹ｽ 魹ｽﾖｴ魹ｽ.
// 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾇｴ魹ｽ 魹ｽ魹ｽ魹ｽﾚｰ魹ｽ 魹ｽ魹ｽﾆｮ魹ｽ跎｡ 魹ｽ魹ｽ魹ｽﾘｼ魹ｽ 魹ｽﾟｻ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ 魹ｽﾖｴ魹ｽ.
// 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ DriverReset() 魹ｽﾔｼ魹ｽ魹ｽ魹ｽ ﾈ｣魹ｽ魹ｽ魹ｽﾏｰﾅｳ魹ｽ 魹ｽ魹ｽ魹ｽ蟶ｦ 魹ｽ魹ｽ魹ｽﾂｽ魹ｽ魹ｽﾑｾ魹ｽ 魹ｽﾑｴ魹ｽ.
// - axis : 0(Z) : 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾈ｣
// - return : 0(魹ｽ魹ｽ魹ｽ魹ｽ), 1(魹ｽ魹ｽ魹ｽ魹ｽ)
char DriverErrorCheck(char axis);

// 魹ｽ魹ｽ魹ｽﾜｸ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽﾌｹ魹ｽ IC魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽﾂｽ魹ｽﾅｰ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾔｼ魹ｽ
// MoveStart 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾃｿ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ '1' 魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽﾏｵ魹ｽ 魹ｽ魹ｽ魹ｽ 魹ｽﾇｴ魹ｽ,
// DriverErrorCheck 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ '1' 魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽﾏｵ魹ｽ 魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ 魹ｽﾔｼ魹ｽ魹ｽ魹ｽ ﾈ｣魹ｽ魹ｽ魹ｽﾏｿ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ 魹ｽﾖｴ魹ｽ.
// - axis : 0(Z) : 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾈ｣
void DriverReset(char axis);

// 魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ
// _MOVE_VARIABLE 魹ｽ魹ｽ魹ｽ魹ｽﾃｼ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾏｿ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾑｴ魹ｽ.
// - axis : 0(Z) : 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾈ｣
// - return :	0(魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ箏ｿ)
//				1(魹ｽ魹ｽ魹ｽ魹ｽ : 魹ｽ魹ｽ魹ｽﾜｸ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽﾌｹ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ)
//				2(魹ｽ魹ｽ魹ｽ魹ｽ : 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽﾂｰ魹ｽ MOVE_STS_STOP 魹ｽ魹ｽ魹ｽﾂｰ魹ｽ 魹ｽﾆｴ魹ｽ 魹ｽ魹ｽ魹ｽ)
//				3(魹ｽ魹ｽ魹ｽ魹ｽ : 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾌｻ魹ｽ魹ｽ魹ｽ 魹ｽﾖｾ贒ｭ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ箏ｿ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ)
// - 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ :
//				魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾓｵ魹ｽ魹ｽ魹ｽ 0 魹ｽﾌｰ魹ｽ 魹ｽ魹ｽ魹ｽﾓｵ魹ｽ魹ｽ魹ｽ 0 魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ
//				魹ｽﾖｴ魹ｽﾓｵ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾓｵ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ
//				魹ｽﾖｴ魹ｽﾓｵ魹ｽ魹ｽ魹ｽ 0 魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ
char MoveStart(char axis);

// 魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ
// _MOVE_VARIABLE 魹ｽ魹ｽ魹ｽ魹ｽﾃｼ魹ｽ魹ｽ m_uAcel 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾏｿ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾑｴ魹ｽ.
// - axis : 0(Z) : 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾈ｣
void MoveStop(char axis);

// 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽﾂｸ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾂｴ魹ｽ.
// - axis : 0(Z) : 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾈ｣
// - return : 
//   0x00	: (MOVE_STS_STOP)	魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ
//   0x01	: (MOVE_STS_VMIN)	魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ
//   0x02	: (MOVE_STS_ACEL)	魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ
//   0x03	: (MOVE_STS_VMAX)	魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ (魹ｽﾖｴ魹ｽ魹ｽ)
//   0x04	: (MOVE_STS_DCEL)	魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ
//   0x05	: (MOVE_STS_INPOS)	INPOSITION 魹ｽ魹ｽ魹ｽ魹ｽ
char GetMoveStatus(char axis);

// 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ ﾈｦ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ
// 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽﾍｿ魹ｽ 魹ｽ蟶｣魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾙｿ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽﾂｼﾒｸ魹ｽ 魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾑｴ魹ｽ.
// _MOVE_VARIABLE 魹ｽ魹ｽ魹ｽ魹ｽﾃｼ魹ｽ魹ｽ m_ucHoldTorq 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾏｿ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾑｴ魹ｽ.
// - axis : 0(Z) : 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾈ｣
void SetHoldTorque(char axis);

// 魹ｽﾞｽ魹ｽ ﾄｫ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ ﾄｫ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾑｴ魹ｽ.
// - axis : 0(R), 1(X), 2(Y) : 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾈ｣
// - dir : 0(CW 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ), 1(CCW 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ)
void SetCounterDirection(char axis, char dir);

// 魹ｽﾞｽ魹ｽ ﾄｫ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 0 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽﾅｲ魹ｽ魹ｽ.
// - axis : 0(Z) : 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾈ｣
void CounterReset(char axis);

// 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽﾄ｡(pulse position)魹ｽ魹ｽ 魹ｽﾐｾ魹ｽ 魹ｽﾂｴ魹ｽ.
int CounterRead(char axis);


//***********************************************
// Encoder Counter Function
//***********************************************

// 魹ｽ魹ｽ魹ｽﾚｴ魹ｽ ﾄｫ魹ｽ魹ｽ魹ｽﾍｸ魹ｽ 魹ｽ魹ｽ魹ｽﾂｽ魹ｽﾅｰ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾔｼ魹ｽ
void EncoderReset(char axis);

// 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ狒｡ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽﾚｴ魹ｽ ﾄｫ魹ｽ魹ｽ魹ｽﾍｿ魹ｽ ﾆｯ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ.
unsigned int EncoderWrite(char axis, unsigned int cnt);

// 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ狒｡ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽﾚｴ魹ｽ ﾄｫ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾐｴﾂｴ魹ｽ.
unsigned int EncoderRead(char axis);

// 魹ｽ魹ｽ魹ｽﾚｴ魹ｽ ﾄｫ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ ﾄｫ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾑｴ魹ｽ.
void SetEncoderDir(int axis, int dir);

// 魹ｽ魹ｽ魹ｽﾚｴ魹ｽ ﾄｫ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ ﾄｫ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽﾂｸ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾂｴ魹ｽ.
char GetEncoderDir(int axis);

//***********************************************
// I/O Function & Define
//***********************************************

// I/O Input 16魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾔｷﾂｰ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾂｴ魹ｽ.
unsigned short GetInput16();

// I/O Output 8魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽﾂｵﾇｰ魹ｽ 魹ｽﾖｴ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾂｴ魹ｽ
unsigned char GetOutput8();

// I/O Output 8魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽﾑｴ魹ｽ.
void SetOutput8(unsigned char data);


#define SENS_ON			1		// Active High
#define SENS_OFF		0		// Active High

// 1 魹ｽ魹ｽ魹ｽ魹ｽ HOME Sensor 魹ｽﾔｷﾂｰ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽﾂｴ魹ｽ. (INPUT1-0, 1-1魹ｽ魹ｽ 魹ｽﾓｽ魹ｽ魹ｽﾒｴ魹ｽ)
// #define HOME_SENSOR	(‾GetInput16() & 0x01)


//***********************************************
// EEPROM Access 魹ｽﾔｼ魹ｽ
// EEPROM SIZE : 8KByte
// Page Size : 32Byte (魹ｽ篌ｻ Write 魹ｽ魹ｽ魹ｽ魹ｽ)
// 魹ｽﾃｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ : 0x0000 ‾ 0x01FF
// 魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ   : 0x0200 ‾ 0x1FFF 
//***********************************************

// EEPROM 1Byte Read
// - usAddr : Address (魹ｽ魹ｽ魹ｽ魹ｽ : 0x0000 ‾ 0x1FFF)
// - return : Read Data
unsigned char ReadI2C_1B(unsigned short usAddr);

// EEPROM Multi Byte Read
// - usAddr : Read 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ Address (魹ｽ魹ｽ魹ｽ魹ｽ : 0x0000 ‾ 0x1FFF)
//            Page Size(32Byte) 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ Address 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾘｾ魹ｽ魹ｽ魹ｽ
// - *pRtn  : Read Data pointer
// - Len    : Read Data Size
void ReadI2C_MB(unsigned short usAddr, unsigned char *pRtn, int Len);

// EEPROM 1Byte Write
// - usAddr : Address (魹ｽ魹ｽ魹ｽ魹ｽ : 0x0000 ‾ 0x1FFF)
// - data   : Write Data
void WriteI2C_1B(unsigned short usAddr, unsigned char data);

// EEPROM Multi Byte Write
// - usAddr : Write 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽ魹ｽ魹ｽ魹ｽ Address (魹ｽ魹ｽ魹ｽ魹ｽ : 0x0000 ‾ 0x1FFF)
//            Page Size(32Byte) 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ Address 魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ魹ｽ 魹ｽﾘｾ魹ｽ魹ｽ魹ｽ
// - *pSrc  : Write Data pointer
// - Len    : Write Data Size
void WriteI2C_MB(unsigned short usAddr, unsigned char *pSrc, int Len);


#endif /* _HARDWARE_H */
