#ifndef _HARDWARE_H
#define _HARDWARE_H

#include "common.h"

//***********************************************
// System Define
//***********************************************
#define	FIRMWARE_VER	0x10

// V5.5  : 2018.08.16, motion status filtering
//                     FPGA Read/Write ïżœïżœïżœïżœïżœïżœ ïżœïżœĂ„
#define		FIRM_VER	0x55
#define		FPGA_VER	FpgaVersion()

//***********************************************
// System Function
//***********************************************

// ïżœÏ”ïżœïżœïżœïżœ ïżœÊ±ïżœÈ­ ïżœÔŒïżœ
// CPU, FPGA ïżœïżœïżœïżœïżœïżœïżœÍžïżœ ïżœÊ±ïżœÈ­ïżœïżœ
void InitHardware();

// ïżœĂžïżœïżœïżœ ïżœïżœÆź 2ïżœïżœ ïżœïżœïżœïżœ
#define UART_PORT0       0
#define UART_PORT1       1

// UART ïżœÊ±ïżœÈ­ ïżœÔŒïżœ
// - port	  : uart port number
// - baudrate : ïżœïżœïżœïżœïżœïżœ baudrate ïżœïżœ (9600 ~ 115200)
void UartInit(int port, unsigned long baudrate);

// UART ïżœïżœïżœĆčïżœïżœÛżïżœïżœïżœ 1 byteïżœïżœ ïżœïżœïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœÔŒïżœ
// - port	: uart port number
// - *ptr : char pointer
// - return : 0(ïżœïżœïżœĆ”ïżœïżœïżœïżœÍŸïżœïżœïżœ), 1(ïżœïżœïżœĆ”ïżœïżœïżœïżœïżœïżœïżœïżœïżœ)
int PopRcvChar(int port, char *ptr);

// UART ïżœÛœïżœ ïżœÔŒïżœ
// - port	: uart port number
// - *bytes : ïżœÛœïżœ ïżœïżœïżœÚżïżœïżœïżœ pointer
// - length : ïżœÛœïżœ ïżœïżœïżœÚżïżœïżœïżœ ïżœïżœïżœïżœ
void SerialWriteBytes(int port, const void *bytes, unsigned long length);
void SerialWriteString(int port, const void *bytes);

// us ïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœïżœïżœ ïżœÔŒïżœ
void DelayUS(unsigned long us);

// ms ïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœïżœïżœ ïżœÔŒïżœ
void DelayMS(unsigned long ms);

// 2013.3.20
// us ïżœïżœïżœïżœïżœïżœ tic counter ïżœïżœïżœïżœ ïżœĐŸïżœÂŽïżœ.
unsigned long GetTicCountUS();

// ïżœïżœïżœïżœïżœ ïżœÖŽïżœ State LEDïżœïżœ ON ïżœïżœĆČïżœïżœ.
void StatusLedOn();

// ïżœïżœïżœïżœïżœ ïżœÖŽïżœ State LEDïżœïżœ OFF ïżœïżœĆČïżœïżœ.
void StatusLedOff();

// ïżœïżœïżœïżœïżœ ïżœÖŽïżœ State LEDïżœïżœ TOGGLE ïżœïżœĆČïżœïżœ.
void StatusLedToggle();

// ïżœĘčïżœ ïżœÔŒïżœ : 1ms ïżœïżœïżœÍ·ïżœÆź ïżœïżœïżœïżœ ïżœïżœÆŸ
// ïżœïżœïżœÌșê·Żïżœïżœ ïżœïżœïżœïżœ ISR ïżœïżœïżœïżœ 25us ïżœÒżïżœïżœ
void TimerIsr_1ms();

// FPGA ïżœïżœïżœïżœ ïżœïżœïżœïżœïżœïżœ ïżœĐŸïżœÂŽïżœ.
unsigned char FpgaVersion();

//***********************************************
// Motion Define & Structure
//***********************************************
//#define	MAX_AXIS		3		// ïżœÖŽïżœ ïżœïżœïżœ

#define	CCW				1		// ïżœïżœïżœïżœïżœïżœ ïżœĘœĂ°ïżœïżœïżœïżœ ïżœïżœïżœïżœ
#define	CW				0		// ïżœïżœïżœïżœïżœïżœ ïżœĂ°ïżœïżœïżœïżœ ïżœïżœïżœïżœ

/*
#define	MOVE_TORQUE		60		// ïżœïżœïżœÛœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ (ïżœïżœïżœïżœ : 0.03A, ïżœïżœïżœïżœ : 0 ~ 100) ex) 40 => 1.2A
#define	HOLD_TORQUE		20		// ïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ (ïżœïżœïżœïżœ : 0.03A, ïżœïżœïżœïżœ : 0 ~ 100) ex) 10 => 0.3A

#define	MOVE_TORQUE_3A	80		// ïżœïżœïżœÛœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ (ïżœïżœïżœïżœ : 0.03A, ïżœïżœïżœïżœ : 0 ~ 100) ex) 80 => 2.4A
#define	HOLD_TORQUE_3A	20		// ïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ (ïżœïżœïżœïżœ : 0.03A, ïżœïżœïżœïżœ : 0 ~ 100) ex) 20 => 0.6A
*/
/*
#define	MOVE_TORQUE		30		// ïżœïżœïżœÛœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ (ïżœïżœïżœïżœ : 0.03A, ïżœïżœïżœïżœ : 0 ~ 100) ex) 40 => 1.2A
#define	HOLD_TORQUE		5		// ïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ (ïżœïżœïżœïżœ : 0.03A, ïżœïżœïżœïżœ : 0 ~ 100) ex) 10 => 0.3A

#define	MOVE_TORQUE_3A	15		// ïżœïżœïżœÛœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ (ïżœïżœïżœïżœ : 0.03A, ïżœïżœïżœïżœ : 0 ~ 100) ex) 80 => 2.4A
#define	HOLD_TORQUE_3A	5		// ïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ (ïżœïżœïżœïżœ : 0.03A, ïżœïżœïżœïżœ : 0 ~ 100) ex) 20 => 0.6A
*/

// ïżœïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœïżœïżœ Èźïżœïżœ ïżœïżœ ïżœïżœ ïżœÖŽïżœ ïżœïżœïżœÂ”ïżœ
// GetMoveStatus() ïżœÔŒïżœïżœïżœ ïżœÌżïżœïżœïżœ ïżœïżœïżœÂžïżœ ïżœïżœïżœĂŒïżœ ïżœÖŽïżœ
#define	MOVE_STS_STOP			0x00	// ïżœïżœïżœïżœ ïżœïżœïżœïżœ
#define	MOVE_STS_VMIN			0x01	// ïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœ
#define	MOVE_STS_ACEL			0x02	// ïżœïżœïżœïżœ ïżœïżœïżœïżœ
#define	MOVE_STS_VMAX			0x03	// ïżœïżœïżœ ïżœïżœïżœïżœ (ïżœÖŽïżœïżœ)
#define	MOVE_STS_DCEL			0x04	// ïżœïżœïżœïżœ ïżœïżœïżœïżœ
#define	MOVE_STS_INPOS			0x05	// INPOSITION ïżœïżœïżœïżœ

// ïżœïżœïżœ ïżœïżœïżœïżœïżœïżœ ïżœÊżïżœïżœïżœ ïżœïżœïżœïżœïżœïżœïżœïżœ ïżœïżœÆłïżœïżœïżœ ïżœïżœïżœïżœĂŒ
// App ïżœïżœïżœïżœ ïżœïżœïżœïżœïżœïżœ ïżœÏ°ïżœ Lib ïżœïżœïżœÎżïżœïżœïżœ ïżœïżœïżœïżœŃŽïżœ.
// MoveStart() ïżœÔŒïżœ ïżœïżœïżœïżœïżœïżœ ïżœïżœ ïżœïżœïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœïżœÏżïżœ ïżœïżœÇ±ïżœïżœïżœïżœïżœ ïżœïżœïżœïżœïżœÏ°ïżœ ïżœÈŽïżœ.
typedef struct _MOVE_VARIABLE
{
	unsigned int  m_uS;			// ïżœÌ”ïżœ ïżœĆžïżœ (ïżœïżœïżœïżœ : pulse, ïżœïżœïżœïżœ : 0 ~ 2147483647)
	unsigned char m_ucDir;		// ïżœÌ”ïżœ ïżœïżœïżœïżœ (0 : CW, 1 : CCW)
	unsigned int  m_uVmax;		// ïżœÖŽïżœ ïżœÓ”ïżœ (ïżœïżœïżœïżœ : pps, ïżœïżœïżœïżœ : 0 ~ 524287)
	unsigned int  m_uVmin;		// ïżœïżœïżœïżœ ïżœÓ”ïżœ (ïżœïżœïżœïżœ : pps, ïżœïżœïżœïżœ : 0 ~ 32767)
	unsigned int  m_uAcel;		// ïżœïżœ/ïżœïżœ ïżœÓ”ïżœ (ïżœïżœïżœïżœ : pps2, ïżœïżœïżœïżœ : 0 ~ 1023)
	unsigned char m_ucMoveTorq;	// ïżœïżœïżœïżœ ïżœïżœïżœïżœ (ïżœïżœïżœïżœ : 0.03A, ïżœïżœïżœïżœ : 0 ~ 100)
	unsigned char m_ucHoldTorq;	// ïżœïżœïżœïżœ ïżœïżœïżœïżœ (ïżœïżœïżœïżœ : 0.03A, ïżœïżœïżœïżœ : 0 ~ 100)
} MOVE_VARIABLE;

// ïżœïżœÆźïżœïżœĆ© ïżœÄ¶ïżœïżœïżœïżœ ïżœïżœïżœïżœĂŒ
// EEPROM ïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœÖŒïżœ : 0x01C0
typedef unsigned char 	BYTE;
typedef struct
{
	BYTE bCheck1;		// 0x0000	// ïżœŚœïżœ 0xa5 ïżœÌŸïżœïżœ ïżœÇčÌ°ïżœ ïżœÖŽïżœ.
	BYTE bCheck2;		// 0x0001	// ïżœŚœïżœ 0x5a ïżœÌŸïżœïżœ ïżœÇčÌ°ïżœ ïżœÖŽïżœ.
    BYTE IPAddr[4];		// 0x0002
    BYTE MACAddr[6];	// 0x0006
    BYTE Mask[4];		// 0x000C
    BYTE GateWay[4];	// 0x0010
	int	 nTcpSvrPort;	// 0x0014

    BYTE bIsDHCPEnabled;// 0x0018

	BYTE NetBIOSName[6];// 0x0019
	BYTE szNull;		// 0x001F
} APPL_CONFIG;

// ïżœĂœïżœïżœïżœ ïżœÚ”ïżœ, ïżœïżœïżœ ïżœïżœïżœïżœĂŒ
// EEPROM ïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœÖŒïżœ : 0x01E0
typedef struct
{
	BYTE szCode[16];// 0
	BYTE nAxis;		// 16
	BYTE nInput;	// 17
	BYTE nOutput;	// 18
	BYTE szNull;	// 19
	int  nTimeout;	// 20	
} SYS_INFO;

extern APPL_CONFIG ApplConfig;
extern SYS_INFO SysInfo;

//***********************************************
// Motion Function
//***********************************************

// ïżœïżœïżœÜžïżœïżœïżœ ïżœïżœïżœïżœÌčïżœ Enable ïżœÔŒïżœ
// - axis : 0(Z) : ïżœïżœïżœïżœïżœïżœïżœÈŁ
void DriverEnable(char axis);

// ïżœïżœïżœÜžïżœïżœïżœ ïżœïżœïżœïżœÌčïżœ Disable ïżœÔŒïżœ
// - axis : 0(Z) : ïżœïżœïżœïżœïżœïżœïżœÈŁ
void DriverDisable(char axis);

// ïżœïżœïżœÜžïżœïżœïżœ ïżœïżœïżœïżœÌčïżœïżœïżœ ïżœÌ»ïżœïżœïżœÂžïżœ ÈźïżœïżœïżœÏ±ïżœ ïżœïżœïżœïżœ ïżœÔŒïżœ
// ïżœïżœïżœÜžïżœïżœïżœ ïżœïżœïżœïżœÌčïżœïżœïżœ ïżœïżœïżœïżœïżœïżœ ïżœÌ»ïżœïżœïżœïżœïżœ ïżœïżœïżœïżœÇžïżœ ïżœïżœïżœïżœÌčïżœïżœïżœ Shutdown ïżœïżœ ïżœïżœ ïżœÖŽïżœ.
// ïżœïżœïżœïżœïżœïżœ ïżœÇŽïżœ ïżœïżœïżœÚ°ïżœ ïżœïżœÆźïżœîżĄ ïżœïżœïżœŰŒïżœ ïżœß»ïżœïżœïżœ ïżœïżœ ïżœÖŽïżœ.
// ïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœ DriverReset() ïżœÔŒïżœïżœïżœ ÈŁïżœïżœïżœÏ°Ćłïżœ ïżœïżœïżœćžŠ ïżœïżœïżœÂœïżœïżœŃŸïżœ ïżœŃŽïżœ.
// - axis : 0(Z) : ïżœïżœïżœïżœïżœïżœïżœÈŁ
// - return : 0(ïżœïżœïżœïżœ), 1(ïżœïżœïżœïżœ)
char DriverErrorCheck(char axis);

// ïżœïżœïżœÜžïżœïżœïżœ ïżœïżœïżœïżœÌčïżœ ICïżœïżœ ïżœïżœïżœÂœïżœĆ°ïżœïżœ ïżœïżœïżœïżœ ïżœÔŒïżœ
// MoveStart ïżœïżœïżœïżœ ïżœĂżïżœ ïżœïżœïżœïżœ '1' ïżœïżœ ïżœïżœïżœÏ”ïżœ ïżœïżœïżœ ïżœÇŽïżœ,
// DriverErrorCheck ïżœïżœïżœïżœ ïżœïżœïżœïżœ '1' ïżœïżœ ïżœïżœïżœÏ”ïżœ ïżœïżœïżœ ïżœïżœ ïżœÔŒïżœïżœïżœ ÈŁïżœïżœïżœÏżïżœ ïżœïżœïżœïżœïżœïżœ ïżœïżœ ïżœÖŽïżœ.
// - axis : 0(Z) : ïżœïżœïżœïżœïżœïżœïżœÈŁ
void DriverReset(char axis);

// ïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ
// _MOVE_VARIABLE ïżœïżœïżœïżœĂŒïżœïżœ ïżœïżœïżœïżœïżœïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœïżœÏżïżœ ïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœïżœŃŽïżœ.
// - axis : 0(Z) : ïżœïżœïżœïżœïżœïżœïżœÈŁ
// - return :	0(ïżœïżœïżœïżœ ïżœâ”ż)
//				1(ïżœïżœïżœïżœ : ïżœïżœïżœÜžïżœïżœïżœ ïżœïżœïżœïżœÌčïżœ ïżœïżœïżœïżœ)
//				2(ïżœïżœïżœïżœ : ïżœïżœïżœïżœ ïżœïżœïżœ ïżœïżœïżœÂ°ïżœ MOVE_STS_STOP ïżœïżœïżœÂ°ïżœ ïżœÆŽïżœ ïżœïżœïżœ)
//				3(ïżœïżœïżœïżœ : ïżœïżœïżœïżœïżœïżœïżœïżœ ïżœÌ»ïżœïżœïżœ ïżœÖŸîŒ­ ïżœïżœïżœïżœ ïżœâ”żïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœ)
// - ïżœïżœïżœïżœïżœïżœïżœïżœïżœïżœïżœïżœ :
//				ïżœïżœïżœïżœïżœÓ”ïżœïżœïżœ 0 ïżœÌ°ïżœ ïżœïżœïżœÓ”ïżœïżœïżœ 0 ïżœïżœ ïżœïżœïżœ
//				ïżœÖŽïżœÓ”ïżœïżœïżœ ïżœïżœïżœïżœïżœÓ”ïżœïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœ
//				ïżœÖŽïżœÓ”ïżœïżœïżœ 0 ïżœïżœ ïżœïżœïżœ
char MoveStart(char axis);

// ïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ
// _MOVE_VARIABLE ïżœïżœïżœïżœĂŒïżœïżœ m_uAcel ïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœÏżïżœ ïżœïżœïżœïżœ ïżœïżœ ïżœïżœïżœïżœ ïżœŃŽïżœ.
// - axis : 0(Z) : ïżœïżœïżœïżœïżœïżœïżœÈŁ
void MoveStop(char axis);

// ïżœïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœÂžïżœ ïżœïżœïżœïżœïżœÂŽïżœ.
// - axis : 0(Z) : ïżœïżœïżœïżœïżœïżœïżœÈŁ
// - return : 
//   0x00	: (MOVE_STS_STOP)	ïżœïżœïżœïżœ ïżœïżœïżœïżœ
//   0x01	: (MOVE_STS_VMIN)	ïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœ
//   0x02	: (MOVE_STS_ACEL)	ïżœïżœïżœïżœ ïżœïżœïżœïżœ
//   0x03	: (MOVE_STS_VMAX)	ïżœïżœïżœ ïżœïżœïżœïżœ (ïżœÖŽïżœïżœ)
//   0x04	: (MOVE_STS_DCEL)	ïżœïżœïżœïżœ ïżœïżœïżœïżœ
//   0x05	: (MOVE_STS_INPOS)	INPOSITION ïżœïżœïżœïżœ
char GetMoveStatus(char axis);

// ïżœïżœïżœïżœïżœïżœ ÈŠïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœ
// ïżœïżœïżœïżœïżœïżœ ïżœïżœïżœÍżïżœ ïżœćžŁïżœïżœ ïżœïżœïżœïżœïżœïżœ ïżœÙżïżœïżœïżœ ïżœïżœïżœÂŒÒžïżœ ïżœïżœ ïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœŃŽïżœ.
// _MOVE_VARIABLE ïżœïżœïżœïżœĂŒïżœïżœ m_ucHoldTorq ïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœÏżïżœ ïżœïżœïżœïżœïżœŃŽïżœ.
// - axis : 0(Z) : ïżœïżœïżœïżœïżœïżœïżœÈŁ
void SetHoldTorque(char axis);

// ïżœȚœïżœ Ä«ïżœïżœïżœïżœïżœïżœ Ä«ïżœïżœïżœïżœ ïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœïżœŃŽïżœ.
// - axis : 0(R), 1(X), 2(Y) : ïżœïżœïżœïżœïżœïżœïżœÈŁ
// - dir : 0(CW ïżœïżœïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœ), 1(CCW ïżœïżœïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœ)
void SetCounterDirection(char axis, char dir);

// ïżœȚœïżœ Ä«ïżœïżœïżœïżœ ïżœïżœïżœïżœ 0 ïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœĆČïżœïżœ.
// - axis : 0(Z) : ïżœïżœïżœïżœïżœïżœïżœÈŁ
void CounterReset(char axis);

// ïżœïżœïżœïżœ ïżœïżœÄĄ(pulse position)ïżœïżœ ïżœĐŸïżœ ïżœÂŽïżœ.
int CounterRead(char axis);


//***********************************************
// Encoder Counter Function
//***********************************************

// ïżœïżœïżœÚŽïżœ Ä«ïżœïżœïżœÍžïżœ ïżœïżœïżœÂœïżœĆ°ïżœïżœ ïżœïżœïżœïżœ ïżœÔŒïżœ
void EncoderReset(char axis);

// ïżœïżœïżœïżœ ïżœïżœïżœïżœïżœàżĄ ïżœïżœïżœïżœïżœ ïżœïżœïżœÚŽïżœ Ä«ïżœïżœïżœÍżïżœ ÆŻïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ.
unsigned int EncoderWrite(char axis, unsigned int cnt);

// ïżœïżœïżœïżœ ïżœïżœïżœïżœïżœàżĄ ïżœïżœïżœïżœïżœ ïżœïżœïżœÚŽïżœ Ä«ïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœĐŽÂŽïżœ.
unsigned int EncoderRead(char axis);

// ïżœïżœïżœÚŽïżœ Ä«ïżœïżœïżœïżœïżœïżœ Ä«ïżœïżœïżœïżœ ïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœïżœŃŽïżœ.
void SetEncoderDir(int axis, int dir);

// ïżœïżœïżœÚŽïżœ Ä«ïżœïżœïżœïżœïżœïżœ Ä«ïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœÂžïżœ ïżœïżœïżœïżœïżœÂŽïżœ.
char GetEncoderDir(int axis);

//***********************************************
// I/O Function & Define
//***********************************************

// I/O Input 16ïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœÔ·Â°ïżœïżœïżœ ïżœïżœïżœïżœïżœÂŽïżœ.
unsigned short GetInput16();

// I/O Output 8ïżœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœÂ”Ç°ïżœ ïżœÖŽïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœïżœÂŽïżœ
unsigned char GetOutput8();

// I/O Output 8ïżœïżœïżœïżœ ïżœïżœïżœïżœŃŽïżœ.
void SetOutput8(unsigned char data);


//#define SENS_ON			1		// Active High
//#define SENS_OFF		0		// Active High
#define SENS_ON			0		// Active Low
#define SENS_OFF		1		// Active LOW

// 1 ïżœïżœïżœïżœ HOME Sensor ïżœÔ·Â°ïżœïżœïżœ ïżœïżœïżœïżœïżœÂŽïżœ. (INPUT1-0, 1-1ïżœïżœ ïżœÓœïżœïżœÒŽïżœ)
// #define HOME_SENSOR	(~GetInput16() & 0x01)


//***********************************************
// EEPROM Access ïżœÔŒïżœ
// EEPROM SIZE : 8KByte
// Page Size : 32Byte (ïżœâș» Write ïżœïżœïżœïżœ)
// ïżœĂœïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ : 0x0000 ~ 0x01FF
// ïżœïżœïżœ ïżœïżœïżœïżœ ïżœïżœïżœïżœ   : 0x0200 ~ 0x1FFF 
//***********************************************

// EEPROM 1Byte Read
// - usAddr : Address (ïżœïżœïżœïżœ : 0x0000 ~ 0x1FFF)
// - return : Read Data
unsigned char ReadI2C_1B(unsigned short usAddr);

// EEPROM Multi Byte Read
// - usAddr : Read ïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœ Address (ïżœïżœïżœïżœ : 0x0000 ~ 0x1FFF)
//            Page Size(32Byte) ïżœïżœïżœïżœïżœïżœïżœïżœ Address ïżœïżœïżœïżœïżœïżœ ïżœŰŸïżœïżœïżœ
// - *pRtn  : Read Data pointer
// - Len    : Read Data Size
void ReadI2C_MB(unsigned short usAddr, unsigned char *pRtn, int Len);

// EEPROM 1Byte Write
// - usAddr : Address (ïżœïżœïżœïżœ : 0x0000 ~ 0x1FFF)
// - data   : Write Data
void WriteI2C_1B(unsigned short usAddr, unsigned char data);

// EEPROM Multi Byte Write
// - usAddr : Write ïżœïżœïżœïżœïżœïżœ ïżœïżœïżœïżœ Address (ïżœïżœïżœïżœ : 0x0000 ~ 0x1FFF)
//            Page Size(32Byte) ïżœïżœïżœïżœïżœïżœïżœïżœ Address ïżœïżœïżœïżœïżœïżœ ïżœŰŸïżœïżœïżœ
// - *pSrc  : Write Data pointer
// - Len    : Write Data Size
void WriteI2C_MB(unsigned short usAddr, unsigned char *pSrc, int Len);


#endif /* _HARDWARE_H */
